 #include <stdio.h>
#include <math.h>

int main() {
    int x, y, z;
    float b;

    // Введення значень змінних з клавіатури
    printf("Введіть значення x: ");//рядок для введення цілого числа x
    scanf("%d", &x); //cканування цілого числа
    printf("Введіть значення y: ");//рядок для введення цілого числа y
    scanf("%d", &y); //cканування цілого числа
    printf("Введіть значення z: ");//рядок для введення цілого числа z
    scanf("%d", &z); //cканування цілого числа

    // Обчислення значення функції
    b = (1 + cos(y - 2)) / (pow(x, 4.0) / 2 + pow(sin(z), 2.0));//введення формули

    // Виведення результату на консоль
    printf("Результат: %.2f\n", b);

    return 0;
}
